burakenez/gd32f527-cmake-vscode/Examples/I2C/I2C3_Master_receiver_slave_transmitter_interrupt/Application/Core/Src/main.c
/*!
    \file    main.c
    \brief   master receiver and slave transmitter interrupt

    \version 2026-01-31, V1.4.0, firmware for GD32F527
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "i2c_ie.h"
#include "gd32f527i_eval.h"

uint8_t i2c_buffer_transmitter[16];
uint8_t i2c_buffer_receiver[16];
volatile uint8_t *i2c_txbuffer;
volatile uint8_t *i2c_rxbuffer;
volatile ErrStatus status;
ErrStatus state = ERROR;

void rcu_config(void);
void i2c3_gpio_config(void);
void i2c4_gpio_config(void);
void i2c_config(void);
void i2c_nvic_config(void);
ErrStatus memory_compare(uint8_t *src, uint8_t *dst, uint16_t length);

/*!
    \brief      main function
    \param[in]  none
    \param[out] none
    \retval     none
*/
int main(void)
{
    int i;

    /* initialize LED1, LED2, as the transfer instruction */
    gd_eval_led_init(LED1);
    gd_eval_led_init(LED2);
    /* enable the peripheral clock */
    rcu_config();
    /* configure the I2C3 and I2C4 GPIO ports */
    i2c3_gpio_config();
    i2c4_gpio_config();
    /* configure I2C3 and I2C4 */
    i2c_config();
    /* configure the NVIC peripheral */
    i2c_nvic_config();

    for(i = 0; i < 16; i++) {
        i2c_buffer_transmitter[i] = i + 0x80;
    }
    /* initialize i2c_txbuffer, i2c_rxbuffer and status */
    i2c_txbuffer = i2c_buffer_transmitter;
    i2c_rxbuffer = i2c_buffer_receiver;
    status = ERROR;

    /* enable the I2C3 interrupt */
    i2c_add_interrupt_enable(I2C3, I2C_ADD_INT_ERR | I2C_ADD_INT_STPDET | I2C_ADD_INT_RBNE | I2C_ADD_INT_TC);
    /* enable the I2C4 interrupt */
    i2c_add_interrupt_enable(I2C4, I2C_ADD_INT_ERR | I2C_ADD_INT_STPDET | I2C_ADD_INT_ADDM | I2C_ADD_INT_TI);

    /* the master waits until the I2C bus is idle */
    while(i2c_add_flag_get(I2C3, I2C_ADD_FLAG_I2CBSY));
    /* the master sends a start condition to I2C bus */
    i2c_add_start_on_bus(I2C3);
    while(SUCCESS != status);
    /* if the transfer is successfully completed, LED1 and LED3 is on */
    state = memory_compare(i2c_buffer_transmitter, i2c_buffer_receiver, 16);
    if(SUCCESS == state) {
        /* if success, LED1 and LED2 are on */
        gd_eval_led_on(LED1);
        gd_eval_led_on(LED2);
    } else {
        /* if failed, LED1 and LED2 are off */
        gd_eval_led_off(LED1);
        gd_eval_led_off(LED2);
    }
    while(1) {
    }
}

/*!
    \brief      memory compare function
    \param[in]  src : source data
    \param[in]  dst : destination data
    \param[in]  length : the compare data length
    \param[out] none
    \retval     ErrStatus : ERROR or SUCCESS
*/
ErrStatus memory_compare(uint8_t *src, uint8_t *dst, uint16_t length)
{
    while(length--) {
        if(*src++ != *dst++) {
            return ERROR;
        }
    }
    return SUCCESS;
}

/*!
    \brief      enable the peripheral clock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_config(void)
{
    /* enable GPIOF clock */
    rcu_periph_clock_enable(RCU_GPIOF);
    /* enable I2C3 clock */
    rcu_periph_clock_enable(RCU_I2C3);
    /* enable I2C4 clock */
    rcu_periph_clock_enable(RCU_I2C4);
}

/*!
    \brief      configure the I2C3 GPIO ports
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c3_gpio_config(void)
{
    /* connect PF14 to I2C3_SCL */
    gpio_af_set(GPIOF, GPIO_AF_4, GPIO_PIN_14);
    /* connect PF15 to I2C3_SDA */
    gpio_af_set(GPIOF, GPIO_AF_4, GPIO_PIN_15);
    /* configure GPIO pins of I2C3 */
    gpio_mode_set(GPIOF, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_14);
    gpio_output_options_set(GPIOF, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_14);
    gpio_mode_set(GPIOF, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_15);
    gpio_output_options_set(GPIOF, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_15);
}

/*!
    \brief      configure the I2C4 GPIO ports
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c4_gpio_config(void)
{
    /* connect PF1 to I2C4_SCL */
    gpio_af_set(GPIOF, GPIO_AF_6, GPIO_PIN_1);
    /* connect PF0 to I2C4_SDA */
    gpio_af_set(GPIOF, GPIO_AF_6, GPIO_PIN_0);
    /* configure GPIO pins of I2C4 */
    gpio_mode_set(GPIOF, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_1);
    gpio_output_options_set(GPIOF, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_1);
    gpio_mode_set(GPIOF, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_0);
    gpio_output_options_set(GPIOF, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_0);
}

/*!
    \brief      configure the I2C3 and I2C4 interfaces
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_config(void)
{
    /* configure I2C timing */
    i2c_add_timing_config(I2C3, 0x0, 0x5, 0x0);
    i2c_add_master_clock_config(I2C3, 0x1D, 0x59);
    /* configure slave address */
    i2c_add_master_addressing(I2C3, I2C4_SLAVE_ADDRESS7, I2C_ADD_MASTER_RECEIVE);
    /* configure I2C address */
    i2c_add_address_config(I2C3, I2C3_SLAVE_ADDRESS7, I2C_ADD_ADDFORMAT_7BITS);
    /* configure number of bytes to be transferred */
    i2c_add_transfer_byte_number_config(I2C3, 16);
    /* enable I2C3 */
    i2c_add_enable(I2C3);

    /* configure I2C address */
    i2c_add_address_config(I2C4, I2C4_SLAVE_ADDRESS7, I2C_ADD_ADDFORMAT_7BITS);
    /* enable I2C4 */
    i2c_add_enable(I2C4);
}

/*!
    \brief      configure the NVIC peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_nvic_config(void)
{
    nvic_irq_enable(I2C3_EV_IRQn, 0, 3);
    nvic_irq_enable(I2C4_EV_IRQn, 0, 4);
    nvic_irq_enable(I2C3_ER_IRQn, 0, 2);
    nvic_irq_enable(I2C4_ER_IRQn, 0, 1);
}
